Revit 2026 API

# ColorFillLegendOrigin Property

---

The top left corner of the color fill legend.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Origin { get; set; }
```
```vb
Public Property Origin As XYZ
	Get
	Set
```
```cpp
public:
property XYZ^ Origin {
	XYZ^ get ();
	void set (XYZ^ value);
}
```
```fsharp
member Origin : XYZ with get, set
```

#### Property Value

XYZ

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The origin is not on the view plane that this legend is placed on. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The origin point must be on the view plane this legend is placed on.

#### Reference

ColorFillLegend Class

Autodesk.Revit.DB Namespace